app/Controllers/Admin/Usuarios.php

    public function index()
    {
        $data = [
            'titulo' => 'Listando os usuários',
            'usuarios' => $this->usuarioModel->withDeleted(true)->paginate(2),
---
SELECT *
FROM `usuarios`
 LIMIT 2
SELECT COUNT(*) AS `numrows`
FROM `usuarios`

    private function buscaUsuarioOu404($id = null)
    {
        if (!$id || !$usuario = $this->usuarioModel->withDeleted(true)->where('id', $id)->first()) {
---
SELECT *
FROM `usuarios`
WHERE `id` = '1'
GROUP BY `usuarios`.`id`
ORDER BY `usuarios`.`id` ASC
 LIMIT 1